<?php
//1) Переменная $num может принимать одно из значений: 1, 2, 3 или 4. Если она имеет значение '1',
// то в переменную $result запишем 'зима', если имеет значение '2' – 'лето' и так далее.


    $season = array(1 => Зима, 2 => Весна, 3 => Лето, 4=> Осень);

var_dump($season);
//2) В переменной $day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число
//
// (в первую, вторую или третью).
//3) В переменной $month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц
//
//
// (зима, лето, весна, осень).